constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=64;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inletCH4
    {
        type            patch;
        nFaces          5;
        startFace       10159;
    }
    wallOutside
    {
        type            wall;
        inGroups        1(wall);
        nFaces          70;
        startFace       10164;
    }
    wallTube
    {
        type            wall;
        inGroups        1(wall);
        nFaces          61;
        startFace       10234;
    }
    inletPilot
    {
        type            patch;
        nFaces          5;
        startFace       10295;
    }
    inletAir
    {
        type            patch;
        nFaces          60;
        startFace       10300;
    }
    outlet
    {
        type            patch;
        nFaces          71;
        startFace       10360;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       10431;
    }
    frontAndBack_pos
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          5170;
        startFace       10431;
    }
    frontAndBack_neg
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          5170;
        startFace       15601;
    }
)

// ************************************************************************* //
